app/Http/Controllers/UserAuth/UserAuthController.php

    public function user_register_page(Request $request)
    {
        $reg_user = User::where('user_id', 'like', "%$request->search%")->where('status', 'like', "%$request->status%")
            ->paginate(50);
---
select * from `users` where `user_id` like '%%' and `status` like '%%' limit 50 offset 0
select count(*) as aggregate from `users` where `user_id` like '%%' and `status` like '%%'