app/Http/Controllers/Frontend/FrontendController.php

    public function index(Request $request)
    {
       $data=  $request->validate([
            'gender' => 'nullable|max:200',
            'age' => 'nullable|max:200',
            'religion' => 'nullable|max:200',
            'country_id' => 'nullable|max:200',
            'marital' => 'nullable|max:200',
            'education' => 'nullable|max:200',
            'proffession' => 'nullable|max:200',
        ]);

        $OurClientReview = OurClientReview::get();
        $SylhetiBiye = SylhetiBiye::get();
        $all_title = AllTitle::where('page', 'home')->get();
        $cw_img = ContentWithImage::where('page', 'home')->get();
        $clint_review = ContentWithVideo::where('page', 'home')->get();
        $seo = Seo::where('page', 'home')->first();
        //$user = User::where('status', '0')->with('personal_info')->paginate(20);
        $site_setting = SiteSetting::first();
        $country = Country::get();
        $education = Education::get();
        $profession = Profession::get();
        if(!empty($data)){
        $user = User::with('personal_info')->where('status', 0)->whereHas('personal_info', function($q)  use($request){
            $q->Where('gender', $request->gender );
            $q->orWhere('age', $request->age );
            $q->orWhere('religion', $request->religion );
            $q->orWhere('country_id', $request->country_id );
            $q->orWhere('marital', $request->marital );
            $q->orWhere('education', $request->education );
            $q->orWhere('proffession', $request->proffession );
        })->get();
        }else{
            $user = User::with('personal_info')->where('status', 0)->get();
---
select * from `our_client_reviews`
select * from `sylheti_biyes`
select * from `all_titles` where `page` = 'home'
select * from `content_with_images` where `page` = 'home'
select * from `content_with_videos` where `page` = 'home'
select * from `seos` where `page` = 'home' limit 1
select * from `site_settings` limit 1
select * from `countries`
select * from `education`
select * from `professions`
select * from `users` where `status` = 0 and exists (select * from `your_personal_data` where `users`.`id` = `your_personal_data`.`user_id` and (`gender` = 'Female' or `age` is null or `religion` is null or `country_id` is null or `marital` is null or `education` is null or `proffession` is null))
select * from `users` where `status` = 0