app/Http/Controllers/Backend/Admin/AdminController.php

select * from `users`
select * from `payments` where `status` = 'Free'
select count(*) as aggregate from `your_personal_data` where `gender` = 'male'
select count(*) as aggregate from `your_personal_data` where `gender` = 'female'
select sum(`Visits`) as aggregate from `your_personal_data`
select count(*) as aggregate from `your_personal_data` where `nationality` = 'Bangladeshi'
select count(*) as aggregate from `your_personal_data` where `nationality` = 'Foreigner'
select count(*) as aggregate from `your_personal_data` where `religion` = 'Hindu'
select count(*) as aggregate from `your_personal_data` where `religion` = 'Muslim'
---
    public function AdminDashboard()
    {
        $user = User::get();
        $payment = Payment::where('status', 'Free')->get();
        $totalGrooms = YourPersonalData::where('gender','male')->count();
        $totalBrides = YourPersonalData::where('gender','female')->count();
        $totalVisits = YourPersonalData::sum('Visits');
        $totalDeshiUsers = YourPersonalData::where('nationality', 'Bangladeshi')->count();
        $totalForeignerUsers = YourPersonalData::where('nationality','Foreigner')->count();
        $totalHinduUsers = YourPersonalData::where('religion','Hindu')->count();
        $totalMuslimUsers = YourPersonalData::where('religion','Muslim')->count();

select * from `payments` where `user_id` like '%%' and `status` like '%%' order by `status` asc
---
    public function payment(Request $request)
    {
        $payment = Payment::orderBy('status', 'ASC')->where('user_id', 'like', "%$request->search%")->where('status', 'like', "%$request->status%")->get();

select count(*) as aggregate from `visitors`
---
    public function getTotalVisitorCount()
{
    return Visitor::count();